app/helpers/sessions_helper.rb

  def current_user
    if session[:id]
      @current_user ||= User.find_by(id: session[:id])
    elsif cookies.signed[:id]
      user = User.find_by(id: cookies.signed[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]