app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "first post body"], ["title", "the first post"], ["user_id", 8], ["created_at", "2019-05-09 10:29:09.883279"], ["updated_at", "2019-05-09 10:29:09.883279"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save

SELECT "posts".* FROM "posts"
---
  def all_posts
    @posts = Post.all